{
  "videoFramerate": 24,
  "videos": [
    {
      "title": "Surface air temperature",
      "src_av1": "https://raw.githubusercontent.com/ali-ramadhan/artifact-sandbox/main/temperature_av1_preset3_crf38.mp4",
      "src_h264": "https://raw.githubusercontent.com/ali-ramadhan/artifact-sandbox/main/temperature_h264_veryslow_crf28.mp4",
      "dateStart": "2018-12-01T00:00:00",
      "framePeriod": 3600,
      "colorbar": "/assets/images/colorbars/temperature_colorbar.png",
      "tooltips": {
        "Diurnal cycle": {
          "latitude": 39.78723,
          "longitude": -98.21005,
          "color": "red",
          "title": "The diurnal cycle",
          "text": "As the sun pass over land it heats up the atmosphere. Looking at the surface air temperature, it almost looks like a beating heart. Peak daily temperatures usually occur 3-4 hours after high noon. The diurnal cycle is especially prominent in high desert regions such as the Tibetan and Andean Plateaus.",
          "comment": "GPS @ Mankato, KS: Very close to the geographical center of the contiguous states."
        },
        "Polar Vortex": {
          "latitude": 82.4987,
          "longitude": -123.11934,
          "color": "gold",
          "title": "The polar vortex",
          "text": "Strong circumpolar winds encircle the North Pole high up in the stratosphere (15-50 km high), trapping a huge mass of cold air. This feature of the atmosphere's circulation is called the polar vortex and another one exists at the South Pole too as well as on some other planets! The polar vortex can weaken allowing the Arctic air to escape and bring frigid temperatures to Canada and the United States like it did on December 30, 2018.",
          "comment": "Same latitude as Alert, NU; Same longitude as Vancouver, BC"
        },
        "Extratropics": {
          "latitude": 41.87395,
          "longitude": -176.63402,
          "color": "red",
          "title": "Extratropical weather",
          "text": "The weather of the extratropics is highly variable due to the constant clashing of cold polar air masses from the north and warm tropical air masses from the south, which leads to the creation of weather fronts. The jet stream flows eastward driving weather patterns and storms towards the east as well. You can see this here as the temperature patterns get advected eastward.",
          "comment": "GPS @ 10° south of Adak, AK."
        },
        "Tropics": {
          "latitude": 12.13282,
          "longitude": -116.2504,
          "color": "green",
          "title": "Tropical weather",
          "text": "The weather of the tropics is less variable than the extratropics. This is due to the relatively constant amount of solar radiation they receive throughout the year. The warm ocean also provides a constant source of warm moist air which inhibits weather systems from forming. You can still get powerful thunderstorms and monsoons over land, but the tropical ocean is pretty quiet.",
          "comment": "GPS @ 30° west of Managua, Nicaragua"
        }
      }
    },
    {
      "title": "Precipitation",
      "src_av1": "https://raw.githubusercontent.com/ali-ramadhan/artifact-sandbox/main/precipitation_av1_preset3_crf52.mp4",
      "src_h264": "https://raw.githubusercontent.com/ali-ramadhan/artifact-sandbox/main/precipitation_h264_veryslow_crf34.mp4",
      "dateStart": "2017-08-16T00:00:00",
      "framePeriod": 3600,
      "colorbar": "/assets/images/colorbars/precipitation_colorbar.png",
      "tooltips": {
        "Hurricane Harvey": {
          "latitude": 28.02077,
          "longitude": -97.05601,
          "color": "green",
          "title": "Hurricane Harvey",
          "text": "Here you can see where Hurricane Harvey made landfall near Rockport, Texas on August 25, 2017. It was a Category 4 hurricane with maximum sustained winds of 130 mph, making it the strongest hurricane to hit the United States since Hurricane Charley in 2004. It dumped over 40 inches of rain in some areas and caused an estimated $125 billion in damage, making it one of the costliest hurricanes in U.S. history.",
          "comment": "GPS @ Rockport, TX where Hurricane Harvey made landfall."
        },
        "ITCZ": {
          "latitude": 9.86444,
          "longitude": -83.91944,
          "color": "brown",
          "title": "The InterTropical Convergence Zone (ITCZ)",
          "text": "The Intertropical Convergence Zone (ITCZ) is a region near the equator where trade winds from the northern and southern hemispheres converge. This leads to high precipitation rates, especially visible here over the Pacific. The ITCZ is a critical source of precipitation for many equatorial regions and drives ocean currents. It's location and intensity is sensitive to changes in climate and is expected to shift in response to climate change.",
          "comment": "GPS @ 20° west of Cartago, Costa Rica"
        },
        "Tropical precipitation": {
          "latitude": -6.13603,
          "longitude": 23.58979,
          "color": "brown",
          "title": "Tropical precipitation",
          "text": "Powerful thunderstorms tend to form near the equator due to the abundance of warm moist air, intense solar radiation, and atmospheric convergence of the trade winds. You can see this happening almost every day over the Congo basin.",
          "comment": "GPS @ Mbuji-Mayi, Democratic Republic of the Congo"
        },
        "Orographic precipitation": {
          "latitude": 54.31507,
          "longitude": -130.32098,
          "color": "brown",
          "title": "Orographic precipitation",
          "text": "Here the prevailing winds bring moist air from the Pacific Ocean and over the Rocky Mountains, where it cools and condenses into clouds as it rises. This leads to heavy precipitation, especially over the coastal Pacific Northwest due to the how steep the mountains are and how close they are to the coast. You can see several storms hitting the coast and dissipating before they get a chance to penetrate inland.",
          "comment": "GPS @ Prince Rupert, BC"
        }
      }
    },
    {
      "title": "Sea surface temperature",
      "src_av1": "https://raw.githubusercontent.com/ali-ramadhan/artifact-sandbox/main/sst_av1_preset3_crf32.mp4",
      "src_h264": "https://raw.githubusercontent.com/ali-ramadhan/artifact-sandbox/main/sst_h264_veryslow_crf26.mp4",
      "dateStart": "2019-01-01T00:00:00",
      "framePeriod": 86400,
      "colorbar": "/assets/images/colorbars/sst_colorbar.png",
      "tooltips": {
        "Gulf stream": {
          "latitude": 42.3751,
          "longitude": -71.10561,
          "color": "gold",
          "title": "The Gulf Stream",
          "text": "Here you can see the Gulf Stream, a warm ocean current that flows from the Gulf of Mexico to the North Atlantic. By transporting warm water from the tropics to higher latitudes, it moderates the climate of Western Europe. You can see the strong temperature gradient between the cold waters of the North Atlantic and warmer waters southward.",
          "comment": "GPS @ 10° east of Cambridge, MA"
        },
        "ACC": {
          "latitude": -46.90337,
          "longitude": 37.75452,
          "color": "gold",
          "title": "The Antarctic Circumpolar Current (ACC)",
          "text": "Strong eastward winds encircle Antarctica clockwise and without any land to stop them the winds spin up the strongest ocean current on Earth. The ACC acts as a barrier to the mixing of warm and cold waters, allowing the Antarctic to maintain its huge ice sheet. You can see the strong temperature gradient between the cold waters of the Southern Ocean and warmer waters northward.",
          "comment": "GPS @ Marion Island, South Africa"
        }
      }
    },
    {
      "title": "Ocean current speed",
      "src_av1": "https://raw.githubusercontent.com/ali-ramadhan/artifact-sandbox/main/ocean_speed_av1_preset3_crf32.mp4",
      "src_h264": "https://raw.githubusercontent.com/ali-ramadhan/artifact-sandbox/main/ocean_speed_h264_veryslow_crf26.mp4",
      "dateStart": "2020-01-01T00:00:00",
      "framePeriod": 86400,
      "colorbar": "/assets/images/colorbars/ocean_speed_colorbar.png",
      "tooltips": {
        "Gulf stream": {
          "latitude": 42.3751,
          "longitude": -71.10561,
          "color": "gold",
          "title": "The Gulf Stream",
          "text": "Here you can see the Gulf Stream, a warm ocean current that flows from the Gulf of Mexico to the North Atlantic. By transporting warm water from the tropics to higher latitudes, it moderates the climate of Western Europe.",
          "comment": "GPS @ 10° east of Cambridge, MA"
        },
        "ACC": {
          "latitude": 0,
          "longitude": 37.75452,
          "color": "gold",
          "title": "The Antarctic Circumpolar Current",
          "text": "Strong eastward winds encircle Antarctica clockwise and without any land to stop them the winds spin up the strongest ocean current on Earth. The ACC acts as a barrier to the mixing of warm and cold waters, allowing the Antarctic to maintain its huge ice sheet.",
          "comment": "GPS @ Marion Island, South Africa"
        },
        "Agulhaus rings": {
          "latitude": -33.92584,
          "longitude": 18.42322,
          "color": "gold",
          "title": "Agulhaus rings",
          "text": "Agulhas rings are large, swirling masses of water that are shed from the Agulhas Current off the coast of South Africa. The rings transport warm, salty water and nutrients from the Indian Ocean into the Atlantic Ocean. They also look pretty.",
          "comment": "GPS @ Cape Town, South Africa"
        }
      }
    }
  ]
}
